import { JobItem } from './job-list/job-list.component';

export const jobData: JobItem[] = [
   {
      id: 1,
      name: 'Senior Java Software Engineer',
      requirements: '5+ години опит с Java',
      description: 'Using Java and Spring Boot in Microservices-based Architecture.',
      longDescription: `
Търсим Senior Java програмист за да се присъедини към нашия екип.

Отговорности:
- Разработване на високо качествен и ефективен софтуер
- Управление на жизнения цикъл на проектите, включително анализ, дизайн, реализация, тестване и деплой
- Работа в екип с други разработчици, QA инженери и мениджъри
- Поддръжка и подобряване на съществуващи приложения
- Предоставяне на техническа експертиза и поддръжка на клиентите

Изисквания:
- Над 5 години опит в Java разработка
- Добри знания на Java, ООП, структури от данни и алгоритми
- Умение да работи със Spring, Hibernate или друг фреймуърк за приложения
- Умение да работи с бази данни като MySQL, PostgreSQL или Oracle
- Добри знания на английски език
`,
      isRemote: true,
   },
   {
      id: 2,
      name: 'Python Developer',
      requirements: '3+ години опит с Python',
      description:
         'Writing and testing code, debugging programs and integrating applications with third-party web services.',
      longDescription: `
Търсим опитен Python разработчик, който да се присъедини към нашия екип. Ние сме международна IT компания, която разработва софтуерни решения за клиенти от различни отрасли. Ние предлагаме възможности за развитие на кариерата и работа в приятна обстановка.

Задължения:
- Разработка на софтуерни приложения, базирани на Python
- Участие в пълния жизнен цикъл на проектите: от анализ на изискванията до тестване и внедряване
- Участие в поддръжката на съществуващи приложения

Изисквания:
- Опит в програмирането на Python
- Опит в работата с релационни бази данни (SQL)
- Опит със софтуерен дизайн и пълния жизнен цикъл на софтуерните проекти
- Добри комуникационни умения и способност за работа в екип

Предимства:
- Опит в работата със сървърни приложения и мрежови протоколи (TCP/IP, HTTP)
- Опит в работата с уеб технологии (HTML, CSS, JavaScript)
- Опит в работата със системи за управление на съдържание (CMS) като WordPress или Drupal
- Опит в работата с други езици за програмиране като Java, C++ или JavaScript

Оферта:
- Конкурентно заплащане и бонуси в зависимост от постигнатите резултати
- Гъвкаво работно време и възможност за работа от вкъщи
- Богат пакет от социални придобивки
- Възможност за професионално развитие и обучение

Ако сте заинтересовани от обявената позиция, моля изпратете вашето CV и мотивационно писмо. 
Благодарим ви предварително за проявения интерес.   
   `,
      isRemote: false,
   },
   {
      id: 3,
      name: 'Senior iOS Developer',
      requirements: '2+ години опит с Objective-C или Swift',
      description:
         'Responsible for designing and developing mobile applications for devices powered by Apple’s iOS OS',
      longDescription: `
      Ние, успешна софтуерна компания, търсим опитен Senior iOS Developer, който да се присъедини към нашия екип. Ние разработваме иновативни приложения, които се ползват от милиони потребители по света. Ако търсите предизвикателства, възможности за професионално развитие и кариерен растеж, това е идеалната работа за вас.

Задължения:
- Разработка на iOS приложения, които отговарят на изискванията на клиентите и потребителите
- Предоставяне на техническо ръководство и подкрепа на екипа за разработка на приложения
- Поддържане на високо ниво на кодиране, като следвате най-добрите практики и процедури
- Помощ при тестване, отстраняване на грешки и оптимизиране на приложенията

Изисквания:
- Опит в програмирането на iOS приложения с Objective-C и/или Swift
- Опит в работата с Cocoa Touch и други iOS framework-и
- Опит в работата с RESTful API-та и бази данни, като SQLite и Core Data
- Добри познания на софтуерен дизайн и архитектура, както и пълния жизнен цикъл на софтуерните проекти
- Добри комуникационни умения и способност за работа в екип

Предимства:
- Опит в работата със сървърни приложения и мрежови протоколи (TCP/IP, HTTP)
- Опит в работата с уеб технологии (HTML, CSS, JavaScript)
- Опит в работата с други езици за програмиране като Java, C++ или JavaScript

Оферта:
- Конкурентно заплащане и бонуси в зависимост от постигнатите резултати
- Гъвкаво работно време и възможност за работа от вкъщи
- Богат пакет от социални придобивки
- Възможност за професионално развитие и обучение
`,
      isRemote: false,
   },
   {
      id: 4,
      name: 'Intern Cloud Computing',
      requirements: 'студент',
      description:
         'Contribute to the implementation of a parallel programming system. Participate in a consensus-oriented design process.',
      longDescription: `
Търсим студенти или свежо завършили, които желаят да се запознаят с технологиите за облачни услуги и да се присъединят към нашия екип като стажанти Intern Cloud Computing. Ние предлагаме възможност за обучение и професионално развитие в технологична компания, която предоставя услуги на големи международни компании.

Задължения:
- Работа в екип с други разработчици за разработка на облачни решения
- Помощ при изграждането и поддръжката на облачна инфраструктура
- Поддръжка на облачни приложения и инструменти
- Изграждане на интеграционни и тестови среди

Изисквания:
- Студент в сферата на компютърните науки, информационните технологии или смежна област
- Интерес към облачните технологии и желание да се научите повече за тях
- Основни знания по операционни системи и мрежи
- Добри аналитични и проблемни умения
- Добри комуникационни умения и способност за работа в екип

Предимства:
- Познания на езици като Python, Java, C++, Ruby или други
- Опит в работата с облачни услуги като Amazon Web Services, Microsoft Azure или Google Cloud
- Опит в работата със сървърни приложения и мрежови протоколи (TCP/IP, HTTP)

Оферта:
- Възможност за обучение и професионално развитие
- Възможност за работа от вкъщи
- Практически опит в работа в технологична компания
- Работа в екип с опитни професионалисти в областта на облачните технологии      
`,
      isRemote: false,
   },
   {
      id: 5,
      name: 'Software Development Lead .NET',
      requirements: '5+ години опит .NET',
      description:
         'Looking to hire a motivated individual with strong leadership potential, technical skills.',
      longDescription: `
      Търсим Software Development Lead .NET! Ако сте опитен в разработката на софтуер с .NET технологии и имате желание да работите в екип от професионалисти, свържете се с нас за повече информация.
      `,
      isRemote: false,
   },
   {
      id: 6,
      name: 'Системен администратор',
      requirements: '2+ години опит в IT сферата',
      description:
         'Responsible for managing and maintaining the computer systems and networks of an organization',
      longDescription: `
  Към семейството ни търсим да се присъеди Системен администратор, отговарящ на следните изисквания:    
- Завършено образование или друга подготовка в областта на информационните технологии;
- Практически опит и познания по Microsoft OS;
- Основни познания на мрежовите LAN стандарти и протоколи;
- Аналитичност, систематизираност, организираност и отношение към работната среда;
- Умения за работа в екип;
- Минимум 2 години опит в IT сферата;
- Отлични умения за отстраняване на проблеми и техническо разбиране;
- Добро разбиране на TCP/IP и свързаните мрежови технологии;
- Отлични умения за писмена и устна комуникация на английски език.

Предимства:
-Познания относно Backup хардуер и решения;
-Познаване на платформата за виртуализация hyper-v, PowerShell && Linux – предимство;
-Познания в операционните системи за сървъри.

Основни задължения:
- IT HELP DESK - Решаване на проактивни хардуерни и софтуерни проблеми, отстраняване на проблеми;
- Инсталиране, администриране и оптимизиране на технологии за настолни компютри и лаптопи, отдалечено и на място при клиенти;
- Осигуряване на ежедневна поддръжка и мониторинг на настолни компютри, лаптопи, принтери и среди за съхранение;
- Управление и администриране на софтуер, приложения, архивиране и възстановяване;
- Разбиране и прилагане на ИТ стандарти и най -добри практики в зависимост от областта; Инсталиране, конфигуриране, миграция, ъпгрейд и пачове за защита.

Компанията предлага:
- Работа в утвърдена компания, лидер в своята област;
- Възнаграждение ориентирано на база на постигнати резултати;
- Работа с най-новите компютърни технологии и решения;
- Онлайн обучение и сертификация свързани с дейността;
- Перспективно професионално развитие с възможност за практически експерименти в областта;
- Екип от професионалисти и отлична среда за работа;

Ако описаната позиция отговаря на Вашите професионални умения, изпратете автобиография, мотивационно писмо.
`,
      isRemote: false,
   },
];
